app/controllers/trends_controller.rb

	def show
		@twits = Trend.twits(params['id'])
		@trend = Trend.find(params['id'])
---
SELECT `trends`.* FROM `trends` WHERE `trends`.`id` = 57 LIMIT 1